# PANDAS
### data frame
### data series
### different options

In [2]:
import pandas as pd
import numpy as np

In [10]:
df= pd.DataFrame(np.arange(0,6).reshape(2,3), index=["Row1","Row2"],columns=["Col1","Col2","Col3"])

In [7]:
df

      Col1  Col2  Col3
Row1     0     1     2
Row2     3     4     5

In [8]:
df.head()

      Col1  Col2  Col3
Row1     0     1     2
Row2     3     4     5

In [11]:
df.loc['Row1']

Col1    0
Col2    1
Col3    2
Name: Row1, dtype: int32

In [17]:
df.iloc[1]

Col1    3
Col2    4
Col3    5
Name: Row2, dtype: int32

In [23]:

df[0:1]

      Col1  Col2  Col3
Row1     0     1     2

In [25]:

df.iloc[0:1,1:2]

      Col2
Row1     1

In [26]:
df.iloc[0:1,1:]

      Col2  Col3
Row1     1     2

In [29]:
df.iloc[:,1:]

      Col2  Col3
Row1     1     2
Row2     4     5

In [30]:
df.iloc[:,:]

      Col1  Col2  Col3
Row1     0     1     2
Row2     3     4     5

In [32]:
df.iloc[:]

      Col1  Col2  Col3
Row1     0     1     2
Row2     3     4     5

In [36]:
df.iloc[:,:]

      Col1  Col2  Col3
Row1     0     1     2
Row2     3     4     5

# commas not allowed, only row index without iloc->df[:,1:]

# use index to access rows and use column name to access column values

In [41]:
df['Col2']

Row1    1
Row2    4
Name: Col2, dtype: int32

In [44]:
df['Col2'].unique()

array([1, 4])

In [52]:
test_df=pd.read_csv('test1.csv',sep=',')

In [53]:
test_df.head()

   12  Reenu
0  13  Joker
1  12  Reenu
2  13  Joker

In [55]:
test_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   12      3 non-null      int64
 1   Reenu   3 non-null      object
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

In [56]:
df.value_counts()

Col1  Col2  Col3
0     1     2       1
3     4     5       1
Name: count, dtype: int64

In [57]:
df[df['Col1']>1]

      Col1  Col2  Col3
Row2     3     4     5

# to read a string with cs values from a csv file use StringIO, directly reading wil lead to error

In [58]:
from io import StringIO,BytesIO

In [64]:
data=('col1,col2,col3\n'
      'x,y,1\n'
      'a,b,2\n')

In [65]:
type(data)

str

In [66]:
StringIO()

In [67]:
pd.read_csv(StringIO(data))

  col1 col2  col3
0    x    y     1
1    a    b     2

In [80]:
pd.read_csv(StringIO(data),usecols=lambda x: x.upper() in ['COL1'])

  col1
0    x
1    a

In [84]:
pd.read_csv(StringIO(data),usecols=lambda x: x in ['col2'])

  col2
0    y
1    b

In [86]:
pd.read_csv(StringIO(data),usecols= ['col3','col1'])

  col1  col3
0    x     1
1    a     2

In [87]:
df.to_csv('test2.csv')

# specify colun data types

In [98]:
data1=('a,b,c\n'
       '1,2,3\n'
       '3,4,5')

In [99]:
df2=pd.read_csv(StringIO(data1),dtype=object)

In [100]:
df2

   a  b  c
0  1  2  3
1  3  4  5

In [103]:
df2['a']

0    1
1    3
Name: a, dtype: object

In [104]:
df2=pd.read_csv(StringIO(data1),dtype=float)

In [105]:
df2

     a    b    c
0  1.0  2.0  3.0
1  3.0  4.0  5.0

In [108]:
df2=pd.read_csv(StringIO(data1),dtype={'a':int,'b':float,'c':'Int64'})

In [111]:
type(df2['a'][1])

numpy.int32

In [112]:
type(df2['c'][1])

numpy.int64

In [113]:
type(df2['b'][1])

numpy.float64

# selecting existing column as index

In [116]:
data2=('index,b,c\n'
       '1,2,3\n'
       '3,4,5')

In [117]:
pd.read_csv(StringIO(data2), index_col=0)

       b  c
index
1      2  3
3      4  5

In [126]:
df4=pd.read_csv(StringIO(data1),index_col=False)

In [127]:
df4

   a  b  c
0  1  2  3
1  3  4  5

In [121]:
data3='a,b\n
"hello, \\"Bob\\", nice to see you",5'

In [124]:
pd.read_csv(StringIO(data3),escapechar='\\')

                               a  b
0  hello, "Bob", nice to see you  5

# read json

df.read_json()

nested json is read as a single column, it can accessed and a dataframe can be created from the nested one or can be accessed as a dictionary

In [131]:
j1=df4.to_json(orient="index")

In [132]:
j1

'{"0":{"a":1,"b":2,"c":3},"1":{"a":3,"b":4,"c":5}}'

In [140]:
df4

   a  b  c
0  1  2  3
1  3  4  5

In [137]:
pd.read_json(StringIO(j1))

   0  1
a  1  3
b  2  4
c  3  5

In [133]:
J2=df4.to_json()

In [134]:
J2

'{"a":{"0":1,"1":3},"b":{"0":2,"1":4},"c":{"0":3,"1":5}}'

In [138]:
pd.read_json(StringIO(J2))

   a  b  c
0  1  2  3
1  3  4  5

In [141]:
j3=df4.to_json(orient="records")

In [142]:
j3

'[{"a":1,"b":2,"c":3},{"a":3,"b":4,"c":5}]'

In [145]:
pd.read_json(StringIO(j3))

   a  b  c
0  1  2  3
1  3  4  5

In [147]:
url='https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/'
dfs=pd.read_html(url)

In [148]:
dfs

[                             Bank NameBank       CityCity StateSt  CertCert  \
 0    Republic First Bank dba Republic Bank   Philadelphia      PA     27332
 1                            Citizens Bank       Sac City      IA      8758
 2                 Heartland Tri-State Bank        Elkhart      KS     25851
 3                      First Republic Bank  San Francisco      CA     59017
 4                           Signature Bank       New York      NY     57053
 ..                                     ...            ...     ...       ...
 564                     Superior Bank, FSB       Hinsdale      IL     32646
 565                    Malta National Bank          Malta      OH      6629
 566        First Alliance Bank & Trust Co.     Manchester      NH     34264
 567      National State Bank of Metropolis     Metropolis      IL      3815
 568                       Bank of Honolulu       Honolulu      HI     21029

                  Acquiring InstitutionAI Closing DateClosing  FundFund
 0      Fulton Bank, National Association      April 26, 2024     10546
 1              Iowa Trust & Savings Bank    November 3, 2023     10545
 2                 Dream First Bank, N.A.       July 28, 2023     10544
 3              JPMorgan Chase Bank, N.A.         May 1, 2023     10543
 4                    Flagstar Bank, N.A.      March 12, 2023     10540
 ..                                   ...                 ...       ...
 564                Superior Federal, FSB       July 27, 2001      6004
 565                    North Valley Bank         May 3, 2001      4648
 566  Southern New Hampshire Bank & Trust    February 2, 2001      4647
 567              Banterra Bank of Marion   December 14, 2000      4646
 568                   Bank of the Orient    October 13, 2000      4645

 [569 rows x 7 columns]]

In [158]:
url1='https://en.wikipedia.org/wiki/Mobile_country_code'
dfr=pd.read_html(url1,match='Country',header=0)

In [160]:
dfr

[     Mobile country code                                    Country ISO 3166  \
 0                    289                                 A Abkhazia    GE-AB
 1                    412                                Afghanistan       AF
 2                    276                                    Albania       AL
 3                    603                                    Algeria       DZ
 4                    544  American Samoa (United States of America)       AS
 ..                   ...                                        ...      ...
 247                  452                                    Vietnam       VN
 248                  543                        W Wallis and Futuna       WF
 249                  421                                    Y Yemen       YE
 250                  645                                   Z Zambia       ZM
 251                  648                                   Zimbabwe       ZW

                                   Mobile network codes National MNC authority  \
 0             List of mobile network codes in Abkhazia                    NaN
 1          List of mobile network codes in Afghanistan                    NaN
 2              List of mobile network codes in Albania                    NaN
 3              List of mobile network codes in Algeria                    NaN
 4       List of mobile network codes in American Samoa                    NaN
 ..                                                 ...                    ...
 247        List of mobile network codes in the Vietnam                    NaN
 248  List of mobile network codes in Wallis and Futuna                    NaN
 249          List of mobile network codes in the Yemen                    NaN
 250             List of mobile network codes in Zambia                    NaN
 251           List of mobile network codes in Zimbabwe                    NaN

                       Remarks
 0    MCC is not listed by ITU
 1                         NaN
 2                         NaN
 3                         NaN
 4                         NaN
 ..                        ...
 247                       NaN
 248                       NaN
 249                       NaN
 250                       NaN
 251                       NaN

 [252 rows x 6 columns]]

In [159]:
dfr[0]

,Mobile country code,Country,ISO 3166,Mobile network codes,National MNC authority,Remarks
0,289,A Abkhazia,GE-AB,List of mobile network codes in Abkhazia,NaN,MCC is not listed by ITU
1,412,Afghanistan,AF,List of mobile network codes in Afghanistan,NaN,NaN
2,276,Albania,AL,List of mobile network codes in Albania,NaN,NaN
3,603,Algeria,DZ,List of mobile network codes in Algeria,NaN,NaN
4,544,American Samoa (United States of America),AS,List of mobile network codes in American Samoa,NaN,NaN
...,...,...,...,...,...,...
247,452,Vietnam,VN,List of mobile network codes in the Vietnam,NaN,NaN
248,543,W Wallis and Futuna,WF,List of mobile network codes in Wallis and Futuna,NaN,NaN
249,421,Y Yemen,YE,List of mobile network codes in the Yemen,NaN,NaN
250,645,Z Zambia,ZM,List of mobile network codes in Zambia,NaN,NaN
251,648,Zimbabwe,ZW,List of mobile network codes in Zimbabwe,NaN,NaN

# df_excel=pd.read_Excel("test1.xslx",sheet_name=1) with no sheet name deafult is 0

In [175]:
 df_excel=pd.read_excel("test2.xlsx",sheet_name=1)

In [176]:
df_excel

   a  b  c
0  1  2  3
1  4  5  6

In [180]:
 df_excel2=pd.read_excel("test2.xlsx",sheet_name='test2')

In [181]:
df_excel2

   col1 col2
0     0    y
1     1    b

# Pickling

### all pd objects equippe diwth to_pickle methods , which use Pythons cPIckle module to sve data structures to disk using the pickle format

In [167]:
df4

   a  b  c
0  1  2  3
1  3  4  5

In [168]:
df4.to_pickle('df4')

In [170]:
pd.read_pickle('df4')

   a  b  c
0  1  2  3
1  3  4  5

mask(), rolling.mean(), map(), pipe(), transform(),apply(),nunique(), df.shape

In [182]:
df4.shape

(2, 3)